In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("hotel_bookings.csv")

In [3]:
df.head()

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
0,1,Standard,2025-07-23,2025-07-26,3,2000,1928,7928
1,2,Suite,2024-06-30,2024-07-03,3,12000,1692,37692
2,3,Suite,2025-04-30,2025-05-02,2,12000,43,24043
3,4,Standard,2024-07-27,2024-08-03,7,2000,1358,15358
4,5,Standard,2024-06-14,2024-06-18,4,2000,1413,9413

In [4]:
df.shape

(10000, 8)

In [5]:
df.columns

Index(['Booking_id', 'Room_type', 'Check_in_date', 'Check_out_date',
       'Stay_duration', 'Room_price', 'Room_service_cost', 'Total_bill'],
      dtype='object')

In [6]:
df.dtypes

Booking_id            int64
Room_type            object
Check_in_date        object
Check_out_date       object
Stay_duration         int64
Room_price            int64
Room_service_cost     int64
Total_bill            int64
dtype: object

In [7]:
df["Check_in_date"] = pd.to_datetime(df["Check_in_date"])
df["Check_out_date"] = pd.to_datetime(df["Check_out_date"])

In [8]:
df.head(10)

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
0,1,Standard,2025-07-23,2025-07-26,3,2000,1928,7928
1,2,Suite,2024-06-30,2024-07-03,3,12000,1692,37692
2,3,Suite,2025-04-30,2025-05-02,2,12000,43,24043
3,4,Standard,2024-07-27,2024-08-03,7,2000,1358,15358
4,5,Standard,2024-06-14,2024-06-18,4,2000,1413,9413
5,6,Executive,2025-11-12,2025-11-16,4,8000,2329,34329
6,7,Standard,2025-04-23,2025-04-28,5,2000,847,10847
7,8,Deluxe,2025-12-06,2025-12-11,5,4000,761,20761
8,9,Suite,2025-04-06,2025-04-07,1,12000,1295,13295
9,10,Standard,2025-07-31,2025-08-02,2,2000,433,4433

In [9]:
df.tail()

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
9995,9996,Suite,2025-12-07,2025-12-11,4,12000,1508,49508
9996,9997,Standard,2024-04-07,2024-04-13,6,2000,1848,13848
9997,9998,Executive,2024-08-23,2024-08-25,2,8000,1241,17241
9998,9999,Deluxe,2024-09-21,2024-09-23,2,4000,984,8984
9999,10000,Executive,2024-09-22,2024-09-27,5,8000,742,40742

Filtering data

In [10]:
# Only suites
df[df["Room_type"] == "Suite"]

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
1,2,Suite,2024-06-30,2024-07-03,3,12000,1692,37692
2,3,Suite,2025-04-30,2025-05-02,2,12000,43,24043
8,9,Suite,2025-04-06,2025-04-07,1,12000,1295,13295
18,19,Suite,2025-06-23,2025-06-26,3,12000,2730,38730
21,22,Suite,2025-11-04,2025-11-05,1,12000,2741,14741
...,...,...,...,...,...,...,...,...
9964,9965,Suite,2024-09-20,2024-09-26,6,12000,1593,73593
9966,9967,Suite,2025-08-05,2025-08-10,5,12000,1433,61433
9973,9974,Suite,2024-12-11,2024-12-18,7,12000,2059,86059
9979,9980,Suite,2024-06-08,2024-06-09,1,12000,1449,13449
9995,9996,Suite,2025-12-07,2025-12-11,4,12000,1508,49508

In [11]:
# High-value bookings
df[df["Total_bill"] > 20000]

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
1,2,Suite,2024-06-30,2024-07-03,3,12000,1692,37692
2,3,Suite,2025-04-30,2025-05-02,2,12000,43,24043
5,6,Executive,2025-11-12,2025-11-16,4,8000,2329,34329
7,8,Deluxe,2025-12-06,2025-12-11,5,4000,761,20761
12,13,Executive,2024-06-06,2024-06-09,3,8000,2806,26806
...,...,...,...,...,...,...,...,...
9988,9989,Deluxe,2025-11-27,2025-12-03,6,4000,174,24174
9991,9992,Executive,2025-03-04,2025-03-11,7,8000,1176,57176
9994,9995,Deluxe,2024-09-20,2024-09-25,5,4000,13,20013
9995,9996,Suite,2025-12-07,2025-12-11,4,12000,1508,49508
9999,10000,Executive,2024-09-22,2024-09-27,5,8000,742,40742

In [12]:
# Multiple conditions
df[
    (df["Room_type"] == "Deluxe") &
    (df["Stay_duration"] > 3)
]

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
7,8,Deluxe,2025-12-06,2025-12-11,5,4000,761,20761
11,12,Deluxe,2025-08-28,2025-09-01,4,4000,1583,17583
13,14,Deluxe,2025-07-27,2025-08-01,5,4000,1744,21744
14,15,Deluxe,2024-08-09,2024-08-15,6,4000,725,24725
16,17,Deluxe,2025-12-11,2025-12-15,4,4000,2865,18865
...,...,...,...,...,...,...,...,...
9978,9979,Deluxe,2025-03-11,2025-03-18,7,4000,797,28797
9986,9987,Deluxe,2024-04-29,2024-05-05,6,4000,1130,25130
9987,9988,Deluxe,2024-05-02,2024-05-09,7,4000,1197,29197
9988,9989,Deluxe,2025-11-27,2025-12-03,6,4000,174,24174
9994,9995,Deluxe,2024-09-20,2024-09-25,5,4000,13,20013

In [13]:
# Top customers/revenue Data
df.sort_values(by="Total_bill", ascending=False)

,Booking_id,Room_type,Check_in_date,Check_out_date,Stay_duration,Room_price,Room_service_cost,Total_bill
7927,7928,Suite,2025-11-19,2025-11-26,7,12000,2994,86994
4574,4575,Suite,2025-09-20,2025-09-27,7,12000,2992,86992
7226,7227,Suite,2024-06-14,2024-06-21,7,12000,2978,86978
8298,8299,Suite,2024-05-04,2024-05-11,7,12000,2975,86975
2702,2703,Suite,2024-03-31,2024-04-07,7,12000,2953,86953
...,...,...,...,...,...,...,...,...
9960,9961,Standard,2025-09-02,2025-09-03,1,2000,63,2063
3580,3581,Standard,2025-05-15,2025-05-16,1,2000,46,2046
4011,4012,Standard,2025-02-05,2025-02-06,1,2000,35,2035
7025,7026,Standard,2024-07-22,2024-07-23,1,2000,18,2018
9950,9951,Standard,2024-07-11,2024-07-12,1,2000,2,2002

In [14]:
# Statistical analysis
df["Total_bill"].mean() #Calculates the average revenue generated per booking across all hotel stays.

np.float64(27580.9459)

In [15]:
df["Total_bill"].max() #Finds the highest single-booking revenue earned by the hotel.

86994

In [16]:
df["Total_bill"].min() #Identifies the lowest revenue generated from a single booking.

2002

In [17]:
# Revenue by room type
df.groupby("Room_type")["Total_bill"].sum()

Room_type
Deluxe        43502029
Executive     85394936
Standard      24144012
Suite        122768482
Name: Total_bill, dtype: int64

In [18]:
# Average stay duration
df.groupby("Room_type")["Stay_duration"].mean()

Room_type
Deluxe       4.028294
Executive    4.020497
Standard     4.047733
Suite        4.007677
Name: Stay_duration, dtype: float64

In [19]:
# Feature Engineering
df["Price_per_day"] = df["Total_bill"] / df["Stay_duration"]

In [20]:
df.to_csv("Hotel_bookings_updated.csv", index=False)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Booking_id         10000 non-null  int64
 1   Room_type          10000 non-null  object
 2   Check_in_date      10000 non-null  datetime64[ns]
 3   Check_out_date     10000 non-null  datetime64[ns]
 4   Stay_duration      10000 non-null  int64
 5   Room_price         10000 non-null  int64
 6   Room_service_cost  10000 non-null  int64
 7   Total_bill         10000 non-null  int64
 8   Price_per_day      10000 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(5), object(1)
memory usage: 703.3+ KB